dobova86/TinyCLR_Port/Targets/STM32H7xx/STM32H7_Display.cpp
int32_t STM32F7_Display_GetWidth();
int32_t STM32F7_Display_GetHeight();
int32_t STM32F7_Display_BitPerPixel();
uint32_t STM32F7_Display_GetPixelClockDivider();
int32_t STM32F7_Display_GetOrientation();
uint32_t* STM32F7_Display_GetFrameBuffer();

static TinyCLR_Display_Provider displayProvider;
static TinyCLR_Api_Info displayApi;

bool STM32F7_Ltdc_Initialize(LTDC_HandleTypeDef *hltdc) {
    uint32_t tmp = 0, tmp1 = 0;

    /* Check the LTDC peripheral state */
    if (hltdc == nullptr) {
        return false;
    }

    /* Configures the HS, VS, DE and PC polarity */
    hltdc->Instance->GCR &= ~(LTDC_GCR_HSPOL | LTDC_GCR_VSPOL | LTDC_GCR_DEPOL | LTDC_GCR_PCPOL);
    hltdc->Instance->GCR |= (uint32_t)(hltdc->Init.HSPolarity | hltdc->Init.VSPolarity | \
        hltdc->Init.DEPolarity | hltdc->Init.PCPolarity);

    /* Sets Synchronization size */
    hltdc->Instance->SSCR &= ~(LTDC_SSCR_VSH | LTDC_SSCR_HSW);
    tmp = (hltdc->Init.HorizontalSync << 16);
    hltdc->Instance->SSCR |= (tmp | hltdc->Init.VerticalSync);

    /* Sets Accumulated Back porch */
    hltdc->Instance->BPCR &= ~(LTDC_BPCR_AVBP | LTDC_BPCR_AHBP);
    tmp = (hltdc->Init.AccumulatedHBP << 16);
    hltdc->Instance->BPCR |= (tmp | hltdc->Init.AccumulatedVBP);

    /* Sets Accumulated Active Width */
    hltdc->Instance->AWCR &= ~(LTDC_AWCR_AAH | LTDC_AWCR_AAW);
    tmp = (hltdc->Init.AccumulatedActiveW << 16);
    hltdc->Instance->AWCR |= (tmp | hltdc->Init.AccumulatedActiveH);

    /* Sets Total Width */
    hltdc->Instance->TWCR &= ~(LTDC_TWCR_TOTALH | LTDC_TWCR_TOTALW);
    tmp = (hltdc->Init.TotalWidth << 16);
    hltdc->Instance->TWCR |= (tmp | hltdc->Init.TotalHeigh);

    /* Sets the background color value */
    tmp = ((uint32_t)(hltdc->Init.Backcolor.Green) << 8);
    tmp1 = ((uint32_t)(hltdc->Init.Backcolor.Red) << 16);
    hltdc->Instance->BCCR &= ~(LTDC_BCCR_BCBLUE | LTDC_BCCR_BCGREEN | LTDC_BCCR_BCRED);
    hltdc->Instance->BCCR |= (tmp1 | tmp | hltdc->Init.Backcolor.Blue);

    /* Enable the transfer Error interrupt */
    hltdc->Instance->IER |= LTDC_IER_TERRIE;

    /* Enable the FIFO underrun interrupt */
    hltdc->Instance->IER |= LTDC_IER_FUIE;

    /* Enable LTDC by setting LTDCEN bit */
    hltdc->Instance->GCR |= LTDC_GCR_LTDCEN;

    return true;
}

void STM32F7_Ltdc_SetConfiguration(LTDC_HandleTypeDef *hltdc, LTDC_LayerCfgTypeDef *pLayerCfg, uint32_t LayerIdx) {
    uint32_t tmp = 0;
    uint32_t tmp1 = 0;
    uint32_t tmp2 = 0;

    /* Configures the horizontal start and stop position */
    tmp = ((pLayerCfg->WindowX1 + ((hltdc->Instance->BPCR & LTDC_BPCR_AHBP) >> 16)) << 16);
    LTDC_LAYER(hltdc, LayerIdx)->WHPCR &= ~(LTDC_LxWHPCR_WHSTPOS | LTDC_LxWHPCR_WHSPPOS);
    LTDC_LAYER(hltdc, LayerIdx)->WHPCR = ((pLayerCfg->WindowX0 + ((hltdc->Instance->BPCR & LTDC_BPCR_AHBP) >> 16) + 1) | tmp);

    /* Configures the vertical start and stop position */
    tmp = ((pLayerCfg->WindowY1 + (hltdc->Instance->BPCR & LTDC_BPCR_AVBP)) << 16);
    LTDC_LAYER(hltdc, LayerIdx)->WVPCR &= ~(LTDC_LxWVPCR_WVSTPOS | LTDC_LxWVPCR_WVSPPOS);
    LTDC_LAYER(hltdc, LayerIdx)->WVPCR = ((pLayerCfg->WindowY0 + (hltdc->Instance->BPCR & LTDC_BPCR_AVBP) + 1) | tmp);

    /* Specifies the pixel format */
    LTDC_LAYER(hltdc, LayerIdx)->PFCR &= ~(LTDC_LxPFCR_PF);
    LTDC_LAYER(hltdc, LayerIdx)->PFCR = (pLayerCfg->PixelFormat);

    /* Configures the default color values */
    tmp = ((uint32_t)(pLayerCfg->Backcolor.Green) << 8);
    tmp1 = ((uint32_t)(pLayerCfg->Backcolor.Red) << 16);
    tmp2 = (pLayerCfg->Alpha0 << 24);
    LTDC_LAYER(hltdc, LayerIdx)->DCCR &= ~(LTDC_LxDCCR_DCBLUE | LTDC_LxDCCR_DCGREEN | LTDC_LxDCCR_DCRED | LTDC_LxDCCR_DCALPHA);
    LTDC_LAYER(hltdc, LayerIdx)->DCCR = (pLayerCfg->Backcolor.Blue | tmp | tmp1 | tmp2);

    /* Specifies the constant alpha value */
    LTDC_LAYER(hltdc, LayerIdx)->CACR &= ~(LTDC_LxCACR_CONSTA);
    LTDC_LAYER(hltdc, LayerIdx)->CACR = (pLayerCfg->Alpha);

    /* Specifies the blending factors */
    LTDC_LAYER(hltdc, LayerIdx)->BFCR &= ~(LTDC_LxBFCR_BF2 | LTDC_LxBFCR_BF1);
    LTDC_LAYER(hltdc, LayerIdx)->BFCR = (pLayerCfg->BlendingFactor1 | pLayerCfg->BlendingFactor2);

    /* Configures the color frame buffer start address */
    LTDC_LAYER(hltdc, LayerIdx)->CFBAR &= ~(LTDC_LxCFBAR_CFBADD);
    LTDC_LAYER(hltdc, LayerIdx)->CFBAR = (pLayerCfg->FBStartAdress);

    if (pLayerCfg->PixelFormat == LTDC_PIXEL_FORMAT_ARGB8888) {
        tmp = 4;
    }
    else if (pLayerCfg->PixelFormat == LTDC_PIXEL_FORMAT_RGB888) {
        tmp = 3;
    }
    else if ((pLayerCfg->PixelFormat == LTDC_PIXEL_FORMAT_ARGB4444) || \
        (pLayerCfg->PixelFormat == LTDC_PIXEL_FORMAT_RGB565) || \
        (pLayerCfg->PixelFormat == LTDC_PIXEL_FORMAT_ARGB1555) || \
        (pLayerCfg->PixelFormat == LTDC_PIXEL_FORMAT_AL88)) {
        tmp = 2;
    }
    else {
        tmp = 1;
    }

    /* Configures the color frame buffer pitch in byte */
    LTDC_LAYER(hltdc, LayerIdx)->CFBLR &= ~(LTDC_LxCFBLR_CFBLL | LTDC_LxCFBLR_CFBP);
    LTDC_LAYER(hltdc, LayerIdx)->CFBLR = (((pLayerCfg->ImageWidth * tmp) << 16) | (((pLayerCfg->WindowX1 - pLayerCfg->WindowX0) * tmp) + 3));

    /* Configures the frame buffer line number */
    LTDC_LAYER(hltdc, LayerIdx)->CFBLNR &= ~(LTDC_LxCFBLNR_CFBLNBR);
    LTDC_LAYER(hltdc, LayerIdx)->CFBLNR = (pLayerCfg->ImageHeight);

    /* Enable LTDC_Layer by setting LEN bit */
    LTDC_LAYER(hltdc, LayerIdx)->CR |= (uint32_t)LTDC_LxCR_LEN;
}


void STM32F7_Ltdc_LayerConfiguration(LTDC_HandleTypeDef *hltdc, LTDC_LayerCfgTypeDef *pLayerCfg, uint32_t LayerIdx) {
    /* Copy new layer configuration into handle structure */
    hltdc->LayerCfg[LayerIdx] = *pLayerCfg;

    /* Configure the LTDC Layer */
    STM32F7_Ltdc_SetConfiguration(hltdc, pLayerCfg, LayerIdx);

    /* Sets the Reload type */
    hltdc->Instance->SRCR = LTDC_SRCR_IMR;

}

bool STM32F7_Display_Initialize() {
    // InitializeConfiguration
    static LTDC_HandleTypeDef hltdc_F;
    LTDC_LayerCfgTypeDef      pLayerCfg;

    const uint32_t STM32F7_DISPLAY_CLOCKDIVS[4] = { 2, 4, 8, 16 };

    uint32_t pll_saiIn;
    uint32_t pll_saiQ;
    uint32_t pll_saiP;
    uint32_t pll_saiR;

    uint32_t div;
    uint32_t clockMHz;

    RCC->CR &= ~(RCC_CR_PLLSAION);

    pll_saiQ = (RCC->PLLSAICFGR >> 24) & 0x0F;
    pll_saiP = (RCC->PLLSAICFGR >> 16) & 0x03;

    pll_saiR = 2;

    div = 0;

