dobova86/TinyCLR_Port/Targets/STM32H7xx/STM32H7_Display.cpp
    if (++m_STM32F7_Display_TextColumn >= (LCD_MAX_COLUMN - 1)) {
        m_STM32F7_Display_TextColumn = 0;

        if (++m_STM32F7_Display_TextRow >= LCD_MAX_ROW) {
            m_STM32F7_Display_TextRow = LCD_MAX_ROW - 1;
            STM32F7_Display_TextShiftColUp();
        }
        else {
            // clean the new line
            for (c = 0; c < LCD_MAX_COLUMN; c++) {
                m_STM32F7_Display_TextBuffer[c][m_STM32F7_Display_TextRow] = ' ';
            }
        }
    }
}
//=======================================================
void STM32F7_Display_PaintPixel(uint32_t x, uint32_t y, uint8_t c) {
    volatile uint16_t * loc;

    if (m_STM32F7_DisplayEnable == false)
        return;

    if (x >= m_STM32F7_DisplayWidth)
        return;
    if (y >= m_STM32F7_DisplayHeight)
        return;

    loc = m_STM32F7_Display_VituralRam + (y *m_STM32F7_DisplayWidth) + (x);

    if (c)
        *loc = 0x0fff;
    else
        *loc = 0;
}
//=======================================================
void STM32F7_Display_Paint8HorizontalPixels(uint32_t x, uint32_t y, uint8_t p) {
    if (m_STM32F7_DisplayEnable == false)
        return;

    for (int32_t i = 0; i < 8; i++) {
        if (p&(1 << i))
            STM32F7_Display_PaintPixel(x, y + i, 1);
        else
            STM32F7_Display_PaintPixel(x, y + i, 0);//clear
    }
}
//===========================================================
void STM32F7_Display_TextEnterClearMode() {
    uint32_t r, c;

    if (m_STM32F7_DisplayEnable == false)
        return;

    STM32F7_Display_Clear();
    m_STM32F7_Display_TextRow = 0;
    m_STM32F7_Display_TextColumn = 0;

    for (r = 0; r < LCD_MAX_ROW; r++) {
        for (c = 0; c < (LCD_MAX_COLUMN - 1); c++) {
            m_STM32F7_Display_TextBuffer[c][r] = '1';
        }
    }
}
//===========================================================
void STM32F7_Display_PrintChracter(uint32_t x, uint32_t y, uint8_t c) {
    uint8_t i;

    if (m_STM32F7_DisplayEnable == false)
        return;

    for (i = 0; i < 5; i++)
        STM32F7_Display_Paint8HorizontalPixels(x + i, y, characters[c][i]);

    STM32F7_Display_Paint8HorizontalPixels(x + i, y, 0);
}

void STM32F7_Display_TextShiftColUp() {
    uint32_t r, c;

    if (m_STM32F7_DisplayEnable == false)
        return;

    // refresh with new data
    STM32F7_Display_Clear();
    m_STM32F7_Display_TextRow = 0;
    m_STM32F7_Display_TextColumn = 0;

    for (r = 0; r < (LCD_MAX_ROW - 1); r++) {
        for (c = 0; c < LCD_MAX_COLUMN - 1; c++) {
            m_STM32F7_Display_TextBuffer[c][r] = m_STM32F7_Display_TextBuffer[c][r + 1];
            STM32F7_Display_WriteFormattedChar(m_STM32F7_Display_TextBuffer[c][r]);
        }
    }
}

void STM32F7_Display_Clear() {
    if (m_STM32F7_DisplayEnable == false || m_STM32F7_Display_VituralRam == nullptr)
        return;

    memset((uint32_t*)m_STM32F7_Display_VituralRam, 0, m_STM32F7_DisplayBufferSize);
}

const STM32F7_Gpio_Pin g_Display_ControllerPins[] = STM32F7_DISPLAY_CONTROLLER_PINS;
const STM32F7_Gpio_Pin g_Display_BacklightPin = STM32F7_DISPLAY_BACKLIGHT_PIN;
const STM32F7_Gpio_Pin g_Display_EnablePin = STM32F7_DISPLAY_ENABLE_PIN;

bool STM32F7_Display_SetPinConfiguration(bool enable) {
    if (enable) {
        for (int32_t i = 0; i < SIZEOF_ARRAY(g_Display_ControllerPins); i++) {
            if (!STM32F7_GpioInternal_OpenPin(g_Display_ControllerPins[i].number)) {
                return false;
            }

            STM32F7_GpioInternal_ConfigurePin(g_Display_ControllerPins[i].number, STM32F7_Gpio_PortMode::AlternateFunction, STM32F7_Gpio_OutputType::PushPull, STM32F7_Gpio_OutputSpeed::High, STM32F7_Gpio_PullDirection::None, g_Display_ControllerPins[i].alternateFunction);
        }

        //if (!STM32F7_GpioInternal_OpenPin(g_Display_EnablePin.number)) {
        //    return false;
        //}

        if (m_STM32F7_DisplayOutputEnableIsFixed) {
            STM32F7_GpioInternal_ConfigurePin(g_Display_EnablePin.number, STM32F7_Gpio_PortMode::GeneralPurposeOutput, STM32F7_Gpio_OutputType::PushPull, STM32F7_Gpio_OutputSpeed::High, STM32F7_Gpio_PullDirection::None, STM32F7_Gpio_AlternateFunction::AF0);
            STM32F7_GpioInternal_WritePin(g_Display_EnablePin.number, m_STM32F7_DisplayOutputEnablePolarity);
        }
        else {
            STM32F7_GpioInternal_ConfigurePin(g_Display_EnablePin.number, STM32F7_Gpio_PortMode::AlternateFunction, STM32F7_Gpio_OutputType::PushPull, STM32F7_Gpio_OutputSpeed::High, STM32F7_Gpio_PullDirection::None, g_Display_EnablePin.alternateFunction);
        }

        if (g_Display_BacklightPin.number != PIN_NONE) {
            if (!STM32F7_GpioInternal_OpenPin(g_Display_BacklightPin.number)) {
                return false;
            }

            STM32F7_GpioInternal_ConfigurePin(g_Display_BacklightPin.number, STM32F7_Gpio_PortMode::GeneralPurposeOutput, STM32F7_Gpio_OutputType::PushPull, STM32F7_Gpio_OutputSpeed::High, STM32F7_Gpio_PullDirection::None, g_Display_BacklightPin.alternateFunction);
            STM32F7_GpioInternal_WritePin(g_Display_BacklightPin.number, true);
        }
    }
    else {
        for (int32_t i = 0; i < SIZEOF_ARRAY(g_Display_ControllerPins); i++) {
            STM32F7_GpioInternal_ClosePin(g_Display_ControllerPins[i].number);
        }

        STM32F7_GpioInternal_ClosePin(g_Display_EnablePin.number);

        STM32F7_GpioInternal_ClosePin(g_Display_BacklightPin.number);
    }

    return true;
}

uint32_t* STM32F7_Display_GetFrameBuffer() {
    return (uint32_t*)m_STM32F7_Display_VituralRam;
}

int32_t STM32F7_Display_GetWidth() {
    int32_t width = m_STM32F7_DisplayWidth;
    int32_t height = m_STM32F7_DisplayHeight;

    STM32F7_Display_GetRotatedDimensions(&width, &height);

    return width;
}

int32_t STM32F7_Display_GetHeight() {
    int32_t width = m_STM32F7_DisplayWidth;
    int32_t height = m_STM32F7_DisplayHeight;

    STM32F7_Display_GetRotatedDimensions(&width, &height);

    return height;
}

uint32_t STM32F7_Display_GetPixelClockDivider() {
    return m_STM32F7_DisplayPixelClockRateKHz;
}
int32_t STM32F7_Display_GetOrientation() {
    return m_STM32F7_Display_CurrentRotation;
}

