dobova86/TinyCLR_Port/Targets/STM32H7xx/STM32H7_Display.cpp
        m_STM32F7_DisplayOutputEnableIsFixed = cfg.DataEnableIsFixed;
        m_STM32F7_DisplayOutputEnablePolarity = cfg.DataEnablePolarity;
        m_STM32F7_DisplayPixelPolarity = cfg.PixelPolarity;

        m_STM32F7_DisplayPixelClockRateKHz = cfg.PixelClockRate / 1000;

        m_STM32F7_DisplayHorizontalSyncPolarity = cfg.HorizontalSyncPolarity;

        m_STM32F7_DisplayHorizontalSyncPulseWidth = cfg.HorizontalSyncPulseWidth;
        m_STM32F7_DisplayHorizontalFrontPorch = cfg.HorizontalFrontPorch;
        m_STM32F7_DisplayHorizontalBackPorch = cfg.HorizontalBackPorch;

        m_STM32F7_DisplayVerticalSyncPolarity = cfg.VerticalSyncPolarity;

        m_STM32F7_DisplayVerticalSyncPulseWidth = cfg.VerticalSyncPulseWidth;
        m_STM32F7_DisplayVerticalFrontPorch = cfg.VerticalFrontPorch;
        m_STM32F7_DisplayVerticalBackPorch = cfg.VerticalBackPorch;

        switch (dataFormat) {
        case TinyCLR_Display_DataFormat::Rgb565:
            m_STM32F7_DisplayBufferSize = width * height * 2;
            break;

        default:
            // TODO 8 - 24 - 32 bits
            break;
        }

        auto memoryProvider = (const TinyCLR_Memory_Provider*)apiProvider->FindDefault(apiProvider, TinyCLR_Api_Type::MemoryProvider);

        if (m_STM32F7_Display_VituralRam != nullptr) {
            memoryProvider->Free(memoryProvider, m_STM32F7_Display_VituralRam);

            m_STM32F7_Display_VituralRam = nullptr;
        }

        m_STM32F7_Display_VituralRam = (uint16_t*)((uint8_t*)memoryProvider->Allocate(memoryProvider, m_STM32F7_DisplayBufferSize));

        if (m_STM32F7_Display_VituralRam == nullptr) {
            return TinyCLR_Result::OutOfMemory;
        }
    }

    return TinyCLR_Result::Success;
}

TinyCLR_Result STM32F7_Display_GetConfiguration(const TinyCLR_Display_Provider* self, int32_t controller, TinyCLR_Display_DataFormat& dataFormat, uint32_t& width, uint32_t& height, void* configuration) {
    dataFormat = TinyCLR_Display_DataFormat::Rgb565;
    width = m_STM32F7_DisplayWidth;
    height = m_STM32F7_DisplayHeight;

    if (configuration != nullptr) {
        auto& cfg = *(TinyCLR_Display_ParallelConfiguration*)configuration;

        cfg.DataEnableIsFixed = m_STM32F7_DisplayOutputEnableIsFixed;
        cfg.DataEnablePolarity = m_STM32F7_DisplayOutputEnablePolarity;
        cfg.PixelPolarity = m_STM32F7_DisplayPixelPolarity;

        cfg.PixelClockRate = m_STM32F7_DisplayPixelClockRateKHz * 1000;

        cfg.HorizontalSyncPolarity = m_STM32F7_DisplayHorizontalSyncPolarity;

        cfg.HorizontalSyncPulseWidth = m_STM32F7_DisplayHorizontalSyncPulseWidth;
        cfg.HorizontalFrontPorch = m_STM32F7_DisplayHorizontalFrontPorch;
        cfg.HorizontalBackPorch = m_STM32F7_DisplayHorizontalBackPorch;

        cfg.VerticalSyncPolarity = m_STM32F7_DisplayVerticalSyncPolarity;

        cfg.VerticalSyncPulseWidth = m_STM32F7_DisplayVerticalSyncPulseWidth;
        cfg.VerticalFrontPorch = m_STM32F7_DisplayVerticalFrontPorch;
        cfg.VerticalBackPorch = m_STM32F7_DisplayVerticalBackPorch;

        return TinyCLR_Result::Success;
    }

    return TinyCLR_Result::InvalidOperation;
}

TinyCLR_Result STM32F7_Display_DrawBuffer(const TinyCLR_Display_Provider* self, int32_t controller, int32_t x, int32_t y, int32_t width, int32_t height, const uint8_t* data) {
    STM32F7_Display_BitBltEx(x, y, width, height, (uint32_t*)data);
    return TinyCLR_Result::Success;
}

TinyCLR_Result STM32F7_Display_WriteString(const TinyCLR_Display_Provider* self, int32_t controller, const char* buffer, size_t length) {
    for (size_t i = 0; i < length; i++)
        STM32F7_Display_WriteFormattedChar(buffer[i]);

    return TinyCLR_Result::Success;
}

TinyCLR_Display_DataFormat dataFormats[] = { TinyCLR_Display_DataFormat::Rgb565 };

TinyCLR_Result STM32F7_Display_GetCapabilities(const TinyCLR_Display_Provider* self, int32_t controller, TinyCLR_Display_InterfaceType& type, const TinyCLR_Display_DataFormat*& supportedDataFormats, size_t& supportedDataFormatCount) {
    type = TinyCLR_Display_InterfaceType::Parallel;
    supportedDataFormatCount = SIZEOF_ARRAY(dataFormats);
    supportedDataFormats = dataFormats;

    return TinyCLR_Result::Success;
}

const TinyCLR_Api_Info* STM32F7_Display_GetApi() {
    displayProvider.Parent = &displayApi;
    displayProvider.Acquire = &STM32F7_Display_Acquire;
    displayProvider.Release = &STM32F7_Display_Release;
    displayProvider.Enable = &STM32F7_Display_Enable;
    displayProvider.Disable = &STM32F7_Display_Disable;
    displayProvider.SetConfiguration = &STM32F7_Display_SetConfiguration;
    displayProvider.GetConfiguration = &STM32F7_Display_GetConfiguration;
    displayProvider.GetCapabilities = &STM32F7_Display_GetCapabilities;
    displayProvider.DrawBuffer = &STM32F7_Display_DrawBuffer;
    displayProvider.WriteString = &STM32F7_Display_WriteString;
    displayProvider.GetControllerCount = &STM32F7_Display_GetControllerCount;

    displayApi.Author = "GHI Electronics, LLC";
    displayApi.Name = "GHIElectronics.TinyCLR.NativeApis.STM32F7.DisplayProvider";
    displayApi.Type = TinyCLR_Api_Type::DisplayProvider;
    displayApi.Version = 0;
    displayApi.Implementation = &displayProvider;

    m_STM32F7_Display_VituralRam = nullptr;

    return &displayApi;
}

void STM32F7_Display_Reset() {
    STM32F7_Display_Clear();

    if (m_STM32F7_DisplayEnable)
        STM32F7_Display_Release(&displayProvider, 0);

    m_STM32F7_DisplayEnable = false;
}

TinyCLR_Result STM32F7_Display_GetControllerCount(const TinyCLR_Display_Provider* self, int32_t& count) {
    count = 1;

    return TinyCLR_Result::Success;
}

#endif //INCLUDE_DISPLAY